# Lecture 05 -- DDL, DML & Constraints

In [27]:
# Run this cell to set up imports
import numpy as np
import pandas as pd

In [28]:
%reload_ext sql

In [29]:
!createdb lecture5 -h localhost

createdb: error: database creation failed: ERROR:  database "lecture5" already exists

In [30]:
%sql postgresql://127.0.0.1:5432/lecture5

# Manager demo

Creating the manager relation

In [31]:
%%sql

DROP TABLE IF EXISTS managers;
CREATE TABLE managers (
    manager_name VARCHAR(20),
    age INTEGER,
    address TEXT,
    manager_id INTEGER
);
SELECT * FROM managers;

Running query in 'postgresql://127.0.0.1:5432/lecture5'

+--------------+-----+---------+------------+
| manager_name | age | address | manager_id |
+--------------+-----+---------+------------+
+--------------+-----+---------+------------+

<br/><br/>

Add a tuple

In [32]:
%%sql
INSERT INTO managers
    (manager_id, age, manager_name)
VALUES
    (1, 23, 'Aditya'),
    (2, 23, 'Lisa')
;

/***********/
SELECT * FROM managers;

Running query in 'postgresql://127.0.0.1:5432/lecture5'

2 rows affected.

2 rows affected.

+--------------+-----+---------+------------+
| manager_name | age | address | manager_id |
+--------------+-----+---------+------------+
|    Aditya    |  23 |   None  |     1      |
|     Lisa     |  23 |   None  |     2      |
+--------------+-----+---------+------------+

What if we add a new tuple?

In [33]:
%%sql
INSERT INTO managers
    (manager_id, manager_name, age)
VALUES
    (1, 'Michael', 123);

/***********/
SELECT * FROM managers;

Running query in 'postgresql://127.0.0.1:5432/lecture5'

1 rows affected.

3 rows affected.

+--------------+-----+---------+------------+
| manager_name | age | address | manager_id |
+--------------+-----+---------+------------+
|    Aditya    |  23 |   None  |     1      |
|     Lisa     |  23 |   None  |     2      |
|   Michael    | 123 |   None  |     1      |
+--------------+-----+---------+------------+

Whoops! We can have two tuples with the same ID!

**Alternate Managers Schema**

One way to to fix is to let the system set the ID. 
This replaces the `manager_id` type with a `SERIAL` instead of an `INTEGER`.

In [34]:
%%sql
DROP TABLE IF EXISTS managers;
CREATE TABLE managers(
    manager_name VARCHAR(20),
    age INTEGER,
    address TEXT,
    manager_id SERIAL
);

/***********/
SELECT * FROM managers;

Running query in 'postgresql://127.0.0.1:5432/lecture5'

+--------------+-----+---------+------------+
| manager_name | age | address | manager_id |
+--------------+-----+---------+------------+
+--------------+-----+---------+------------+

In [35]:
%%sql
INSERT INTO managers
    (age, manager_name)
VALUES
    (23, 'Aditya'),
    (23, 'Lisa')
;

SELECT * FROM managers;

Running query in 'postgresql://127.0.0.1:5432/lecture5'

2 rows affected.

2 rows affected.

+--------------+-----+---------+------------+
| manager_name | age | address | manager_id |
+--------------+-----+---------+------------+
|    Aditya    |  23 |   None  |     1      |
|     Lisa     |  23 |   None  |     2      |
+--------------+-----+---------+------------+

<br/><br/>

And we can add another tuple...

In [36]:
%%sql
INSERT INTO managers
    (age, manager_name)
VALUES
    (123, 'Michael');

SELECT * FROM managers;

Running query in 'postgresql://127.0.0.1:5432/lecture5'

1 rows affected.

3 rows affected.

+--------------+-----+---------+------------+
| manager_name | age | address | manager_id |
+--------------+-----+---------+------------+
|    Aditya    |  23 |   None  |     1      |
|     Lisa     |  23 |   None  |     2      |
|   Michael    | 123 |   None  |     3      |
+--------------+-----+---------+------------+

What if we update Michael's ID?

In [37]:
%%sql
UPDATE Managers
SET manager_id = manager_id -1
WHERE manager_name = 'Michael';

/***********/
SELECT * FROM managers;

Running query in 'postgresql://127.0.0.1:5432/lecture5'

1 rows affected.

3 rows affected.

+--------------+-----+---------+------------+
| manager_name | age | address | manager_id |
+--------------+-----+---------+------------+
|    Aditya    |  23 |   None  |     1      |
|     Lisa     |  23 |   None  |     2      |
|   Michael    | 123 |   None  |     2      |
+--------------+-----+---------+------------+

Whoops! We now have two folks with the same ID